AlexNetz/lvgl_micropython/display_configs/Waveshare-ESP32-S3-Touch-4.3/mpconfigboard.h
#ifndef MICROPY_HW_BOARD_NAME
// Can be set by mpconfigboard.cmake.
#define MICROPY_HW_BOARD_NAME               "Waveshare-ESP32-S3-Touch-4.3"
#endif
#define MICROPY_HW_MCU_NAME                 "esp32s3"

// Enable UART REPL for modules that have an external USB-UART and don't use native USB.
#define MICROPY_HW_ENABLE_UART_REPL         (1)

#define MICROPY_HW_I2C0_SCL                 (9)
#define MICROPY_HW_I2C0_SDA                 (8)
